In [1]:
a=10
b=20
c=a+b
print(c)

30

In [ ]:
================= EDA ==================
1) pandas          : dataframe or data applications
2) numpy           : numerical python for math operations
3) matplotlib      : for plots graph
4) seaborn         : for plots graph
5) bokhe           : for plots
6) plotly          : for plots

============ Machine learning ===============
7)scikit learn(sklearn)  : ml models
8)stats                  : statistical models

============== Data retrival from sql scrapping ================
9) sqlite           : connect with database
10) beautiful soup  : scrap the data frame website
11) websocket       : scrap

============ Deep learning/ computer vision =================
12) tensorflow       : google
13) keras            : dl models
14) opencv           : image operations
15) pillow(PIL)      : image operations
16) pytorch          : Facebook
17) pretrained model
       VGG16
       Mobilenet
       RESNET
       RCNN
       MASKRCNN
       FASTERCNN
       YOLO

============= Natural language process ===========
18) NLTK               : natural language process
19) scipy    
20) word2vec (how words will convert into vectors)
21) Glove
22) wordcloud

============== Hugging face ================
23) transformers     : BERT( Bidirectional Encoder Representations from Transformers)

============= GenAI models ==================
24) openAI+microsoft :GPT models
25) google           : Gemini
26) amaazon          : Q
27) meta facebook    : MetaAI
28) apple

LLMA
GEMMA
Dalle-E
T5

ALL ARE HAVIMG DIFFERENT PACKAGES

============== LANGCHAIN =============
29) Langchain framework

============= Deployment/appllications ===========
30)flask
31) streamlit
32)django

============ Mlops ============
33) mlflow
34) kubeflow
35) azure ai services : azure packeges
36) Gcp : GCP packeges

**step-1**

**create a dataframe**

- we will create a dataframe using list
- we will create a dataframe using dictionary

In [2]:
import pandas as pd

In [4]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [5]:
type(d1)

pandas.core.frame.DataFrame

**step-2**

**provide the data**

In [6]:
names=['bhanu','vishwas','sathish','rakesh']
pd.DataFrame(names)

         0
0    bhanu
1  vishwas
2  sathish
3   rakesh

In [7]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
data=zip(names,age)
pd.DataFrame(data)

         0   1
0    bhanu  20
1  vishwas  21
2  sathish  22
3   rakesh  23

In [8]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
city=['ssn','kmr','hyd','blr']
pd.DataFrame(zip(names,age,city))

         0   1    2
0    bhanu  20  ssn
1  vishwas  21  kmr
2  sathish  22  hyd
3   rakesh  23  blr

**step-3**

**provide the column names**

In [22]:
names=['bhanu','vishwas','sathish']
pd.DataFrame(names,
             columns=['names'])

     names
0    bhanu
1  vishwas
2  sathish

In [23]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
data=zip(names,age)
pd.DataFrame(zip(names,age),
             columns=['names','age'])

     names  age
0    bhanu   20
1  vishwas   21
2  sathish   22
3   rakesh   23

In [24]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
city=['ssn','kmr','hyd','blr']

data=zip(names,age,city)

cols=['names','age','city']

pd.DataFrame(data,columns=cols)

     names  age city
0    bhanu   20  ssn
1  vishwas   21  kmr
2  sathish   22  hyd
3   rakesh   23  blr

**step-4**

**providing index**

In [2]:
import pandas as pd

In [4]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
city=['ssn','kmr','hyd','blr']

Data=zip(names,age,city)
ix=['A','B','C','D']
cols=['names','age','city']

pd.DataFrame(Data,
             index=ix,
             columns=cols)

     names  age city
A    bhanu   20  ssn
B  vishwas   21  kmr
C  sathish   22  hyd
D   rakesh   23  blr

In [20]:
names=['bhanu','vishwas','sathish','rakesh']
age=[20,21,22,23]
city=['ssn','kmr','hyd','blr']
data=zip(names,age,city)
column=['age','city']
pd.DataFrame(zip(names,age,city),columns=['names','age','city'])

     names  age city
0    bhanu   20  ssn
1  vishwas   21  kmr
2  sathish   22  hyd
3   rakesh   23  blr

**step-5**

**add a new column on exixting data frame**

In [13]:
# create a data frame
# name
# age
# city
import pandas as pd
names=['bhanu','vishwas','sathish']
age=[20,21,22,23]
city=['ssn','kmr','hyd']

data=zip(names,age,city)

cols=['names','age','city']

df=pd.DataFrame(data,columns=cols)
df

     names  age city
0    bhanu   20  ssn
1  vishwas   21  kmr
2  sathish   22  hyd

- if you want to add a new column 
- first check how many rows are there 
- for example in above data frame we have 3 rows
- your new columm also should have 3 rows
- suppose i want to create a new column: **salary**
- make a list with 3 values
- salary=[100000,200000,300000]

**syntax**: dataframe[column]=list of values
- salary[100000,200000,300000]
df['salary']=salary

In [15]:
salary=[100000,200000,300000]
df['salary']=salary
df

     names  age city  salary
0    bhanu   20  ssn  100000
1  vishwas   21  kmr  200000
2  sathish   22  hyd  300000

**usecase-1**

- create a empty data frame first

- create 3 list using list comprehension

- list 1= values from1 to 10

- list2= square of 1 to 10

- list3= cube of 1 to 10

- finally make a dataframe

In [25]:
import pandas as pd
df2=pd.DataFrame()
df2

Empty DataFrame
Columns: []
Index: []

In [26]:
import pandas as pd
list1 =[i for i in range(1,10)]
list2 =[i**2 for i in range(1,10)]
list3 =[i**3 for i in range(1,10)]
df2['X']=list1
df2['Y']=list2
df2['Z']=list3
df2

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

**step-6**

**update the alredy existed column**

- create a new column

      - creating a new list

      - df['']

      - creating a new column the column name id our choice

- update existing column are same way only

       - here also we need a make a list of value= number of rows

      - while updating the existing column

      - we need to provide alredy existed column name only

      - df['z']=list of values

In [27]:
z=[i**4 for i in range(1,10)]
df2['z']=z
df2

   X   Y    Z     z
0  1   1    1     1
1  2   4    8    16
2  3   9   27    81
3  4  16   64   256
4  5  25  125   625
5  6  36  216  1296
6  7  49  343  2401
7  8  64  512  4096
8  9  81  729  6561

**step-7**

**drop the column**

In [47]:
# how to check the columns
df1.columns

Index(['X', 'z', 'Y', 'Z'], dtype='object')

- if you want to drop a specific column

- we will use drop method

- we already know about different between keywords and methods

- keywords will use directly

- method will use with corresponding dataframes

- method name: Drop

df1.drop()

- column: which column you want to drop 

- axis: represents the specified value is a row or coumn

      - axis= 0 mean rows

      - axis=1 means colums

- inplace : will provide overwrite the dataframe or not

       - inplace= True , this indicates overwrite the dataframe

       - inplace=False, this indicates the modified dataframe will be use when you provide new variable for the operation

In [19]:
df1.drop('X')
# we ar not providing axis 
# it assuming the provided value is a row
#

KeyError: "['X'] not found in axis"

In [52]:
df1.drop('X',axis=1)

      z   Y    Z
0     1   1    1
1    16   4    8
2    81   9   27
3   256  16   64
4   625  25  125
5  1296  36  216
6  2401  49  343
7  4096  64  512
8  6561  81  729

**step-8**

**drop the row**

In [ ]:
-

In [5]:
# dataframe name: df1
import pandas as pd
df2=pd.DataFrame()
list1 =[i for i in range(1,10)]
list2 =[i**2 for i in range(1,10)]
list3 =[i**3 for i in range(1,10)]
df2['number']=list1
df2['square']=list2
df2['cube']=list3
df2

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [6]:
df2.drop(4)
# if we run this we will get

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [13]:
df2.drop(8)

   number  square  cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512

In [9]:
df2.drop([0,1],axis=1)
# [0.1] index
# axis=1 column
# error

KeyError: '[0, 1] not found in axis'

**step-9**

**how to select the column**

In [14]:
df2['number']

#series type
# no column name display
# whenever you see this typr : series type

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: number, dtype: int64

In [15]:
df2[['number']]

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [16]:
df2[['square']]

   square
0       1
1       4
2       9
3      16
4      25
5      36
6      49
7      64
8      81

In [17]:
type(df2['number'])

pandas.core.series.Series

In [19]:
type(df2[['number']])

pandas.core.frame.DataFrame

In [20]:
df2.number

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: number, dtype: int64

- df2['number']:series type
- df2[['number']]:DataFrame type
- df2.number:series type

In [22]:
cols=['number','square']
df2[cols]

   number  square
0       1       1
1       2       4
2       3       9
3       4      16
4       5      25
5       6      36
6       7      49
7       8      64
8       9      81

In [23]:
df2['number'].values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [ ]:
- all values comes in an array 
- array means it is a list of elements only represents using numpy package
-

In [24]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [25]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [27]:
#tensor([1,2,3,4])

In [28]:
list1=[1,2,3,4]
list2=[10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [30]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [31]:
df2['number'].values
# imagine we worked on an ml problems
# we got same series of values
# with that series of values also we can create a dataframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [35]:
df2['NUMBER']=df2['number'].values
df2

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

**step-10**

**save the dataframe**

- dataframes we can save in two formats

       - csv:comma seperated values

       - xlsx:excel format

- in order to save any data

       - where you want to save : directory name

       - what is the name of the file for storing

        - what is the extention

- we already seen same in file handling session

In [37]:
# case-1:saving file at same location
# no need to provide directory path
# directory give only name of the file
# and extension

In [38]:
# dataframe name:df2
df2.to_csv('Data1.csv')
df2.to_excel('Data1.xlsx')

**step-11**

**how to read a dataframe**

In [40]:
import pandas as ps
pd.read_csv('Data1.csv')

   Unnamed: 0  number  square  cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

In [42]:
import pandas as ps
pd.read_excel('Data1.xlsx')

   Unnamed: 0  number  square  cube  NUMBER
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

**step-12**

**how to avoid index column**

- automatically a new column will create

- that we need to avoide

- permission denied means close the data file from laptop

In [43]:
# dataframe name:df2
df2.to_csv('Data1.csv',index=False)
df2.to_excel('Data1.xlsx',index=False)

In [44]:
import pandas as ps
pd.read_csv('Data1.csv')

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

In [45]:
import pandas as ps
pd.read_excel('Data1.xlsx')

   number  square  cube  NUMBER
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9